
//19:40 : 18
//吴少港 2017 / 11 / 12 19 : 40 : 18
///*
//给出一种物质的分子式， （不带括号）求分子量，本题中的
//分子式只包含四种原子，分别是CHON原子量分别为12.01，1.008
//16.00，14.01，例如，C6H5OH的分子量为94.108g/mol
//*/
#include<stdio.h>
#include<ctype.h>
int main()
{
	char a[20] = { 0 };//定义保存化学式分子种类的数组 
	float m[] = { 0,0,12.01,0,0,0,0,1.008,0,0,0,0,0,14.01,16.00 };//表示原子质量的数组 
	float sum = 0;
	int i = 0, j = 0;
	char k;
	printf("输入原子式(#号结束)：");
	while (1)
	{
		scanf("%c", &a[i]);
		if (a[i] == '#')
			break;
		i++;
	}
	puts(a);
	for (i = 0; i != '#'; ++i)
	{
		if (isalpha(a[i]))
		{
			k = a[i];
			sum = sum + m[k - 'A'];
		}
		else
		{
			j = a[i] - '0';
			while (isdigit(a[i + 1]))
			{
				j = j * 10 + (a[i + 1] - '0');
				i++;
			}
			sum = sum + (j - 1)*m[k - 'A'];
		}
	}
	printf("%0.3f", sum);
	return 0;
}
//吴少港 2017 / 11 / 12 19:40 : 38
//帮忙看看这个哪里有问题
//吴少港 2017 / 11 / 12 19 : 40 : 42
//谢谢啦
//19 : 48 : 37
//Moηth丶 2017 / 11 / 12 19 : 48 : 37

